app/controllers/books_controller.rb

  def index
    @books = Book.order(:title)
---
SELECT "books".* FROM "books" ORDER BY "books"."title" ASC

  def create
    @book = Book.new(book_params)

    if @book.save
---
INSERT INTO "books" ("title", "created_at", "updated_at", "price", "date", "author") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "another book"], ["created_at", "2024-09-02 22:57:39.147234"], ["updated_at", "2024-09-02 22:57:39.147234"], ["price", "4.0"], ["date", "2024-09-02 00:00:00"], ["author", "test"]]

  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "updated_at" = $1, "price" = $2, "date" = $3, "author" = $4 WHERE "books"."id" = $5  [["updated_at", "2024-09-02 22:57:46.028517"], ["price", "4.0"], ["date", "2024-09-02 00:00:00"], ["author", "test"], ["id", 1]]

  def delete
    @book = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]